Revit 2027 API
ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForHooksEnabled Property
 "Hook Bends"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForHooksEnabled { get; }
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsForHooksEnabled As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsForHooksEnabled {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeBendDiameterDimensionsForHooksEnabled : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace